# Aula 1: SQL

## Introdução

- SQL é uma linguagem padrão para trabalhar com bancos de dados relacionais
- É uma linguagem declarativa e que não necessita de profundos conhecimentos de programação para que alguém possa começar a escrever queries
- SQL é acrônimo de Structured Query Language, literalmente a linguagem struturada para realizar queries.
- Apesar de existirem diversos bancos de dados relacionais, cada um com sua funcionalidade, todos possuem comandos básicos que podem ser aplicados em qualquer banco de dados:

![](https://cdn-images-1.medium.com/fit/t/1600/480/1*LcXr-gRpSfe63XjdCVa15A.png)

- Nessa aula usaremos o site https://www.db4free.net/, que utiliza MySQL
- Antes de começarmos, criem uma conta no DB4Free

## Conceitos

### Modelo relacional

- O Modelo entidade relacionamento proposto por Peter P. Chen pode ser melhor compreendido por uma teoria chamada de A lei do Mundo, teoria essa, que conceitua que o mundo está cheio de coisas que possuem características próprias e que se **relacionam entre si**. Sua analise da teoria pode ser dividida em três partes:

- **O mundo está cheio de coisas**
    - Tudo que possa ser caracterizado, conceituado, real ou imaginário, no nosso Universo (Mundo), é definido como coisa, que futuramente, dependendo da abordagem, poderá ser definido como uma **entidade.**

- **Que possuem características próprias**
    - **Características** comuns percebidas entre as coisas de modo que haja a possibilidade de enquadramento dessas coisas em conjuntos particulares
    - Exemplo: “conselho de economia, conselho de medicina, conselho de odontologia” todos podem ser enquadrados em um mesmo conjunto, denominado como Órgão normalizador.

- **E que se relacionam entre si**
    - São as **relações entre as coisas**. Como as mesmas irão relaciona-se entre elementos individualizados de diferentes conjuntos ou entre elementos de um mesmo conjunto. A forma de comunicação entre as coisas ou um conjunto delas
    - Exemplos: Adail é credenciado pelo conselho de economia é um relacionamento entre elementos de diferentes conjuntos. Adail é substituto de Caio é um relacionamento entre elementos do mesmo conjunto.

![](https://consultabd.files.wordpress.com/2019/08/img_relacional-1.jpg)

### Banco de dados

- **Coleção de dados ou informações relacionadas entre si**
- Coleção lógica e coerente de dados com algum significado inerente
- Projetado, construído e povoado por dados, atendendo uma proposta específica
- Dados organizados que se relacionam para criar algum sentido (informação)

![](https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR6BA4uD8n7lv7BCiSyckzIJfzu2Zgssgg5GQ&usqp=CAU)

### SGBD - Sistema de gerenciamento de banco de dados

- Um Sistema de Gerenciamento de Banco de Dados (SGBD) — do inglês Data Base Management System (DBMS) — é o sistema de software responsável pelo gerenciamento de um ou mais bancos de dados
- Seu principal **objetivo é retirar da aplicação cliente a responsabilidade de gerenciar o acesso, a persistência, a manipulação e a organização dos dados**
- O SGBD disponibiliza uma interface para que seus clientes possam incluir, alterar ou consultar dados previamente armazenados
- Em bancos de dados relacionais a interface é constituída pelas APIs (Application Programming Interface) ou drivers do SGBD, que executam comandos na linguagem SQL (Structured Query Language).

![](https://dicasdeprogramacao.com.br/images/o-que-e-um-sgbd/destaque-600x315.png)

### Metadados

- O prefixo "Meta" vem do grego e significa "além de". Assim Metadados são **informações que acrescem aos dados e que têm como objetivo informar-nos sobre eles para tornar mais fácil a sua organização.**
- Um item de um metadado pode informar do que se trata aquele dado numa linguagem inteligível para um computador
- Os metadados tem a **função de facilitar o entendimento dos relacionamentos e evidenciar a utilidade das informações dos dados**

- Praticamente todos os dispositivos digitais geram metadados a partir do uso que fazemos
    - Por exemplo, ao tirar uma foto, além de gravar a foto na memória da foto, metadados são associados a esta foto descrevendo informações sobre o modelo da câmera, tipo de ISO, data, tamanho e formato do arquivo e até o local de onde a foto foi tirada se o aparelho tiver GPS.

- Ao fazer login em um site de redes sociais ou de compras várias informações são registradas além daquelas que escrevemos diretamente nos sites, como por exemplo, o endereço IP, o nome e versão do navegador, horário exato de entrada e saída, bem como outros detalhes sobre os seus cliques durante aquela navegação.

- Os tipos mais comuns de metadados são:

    - Número de telefones, endereços de email e os nomes das pessoas que usam serviços;

    - Dados de Localização: onde está o seu telefone celular;

    - Data e hora em que foram feitas as ligações, emails, arquivos e fotos;

    - Informações do aparelho que você está usando;

    - Os títulos (assuntos) de seus e-mails;

![](http://blog.simbiox.com.br/wp-content/uploads/2020/05/Ilustra%C3%A7%C3%A3o_-Metadados_Blog.png)

### Chave primária
A chave primária, ou `primary key`, é o conceito mais básico relacionado à organização em um banco de dados. Toda tabela possuirá uma, e somente uma, chave primária. Essa chave é utilizada como identificador único da tabela, sendo representada por aquele campo (ou campos) que não receberá valores repetidos.

Por causa disso, existe uma lista de características que deve ser levada em consideração ao definir uma chave primária:

- Chaves primárias não podem ser nulas;
- Cada registro na tabela deve possuir uma, e somente uma, chave primária;
- Normalmente, chaves primárias são incrementadas automaticamente pelo banco de dados, ou seja, não há necessidade de passarmos esse valor em um INSERT
    - Entretanto, essa é uma opção configurada na criação da base de dados que não é obrigatória
    - Nos casos em que ela (incremento automático) não é definida, é preciso garantir que não haverá valores repetidos nessa coluna
- São as chaves para o relacionamento entre entidades ou tabelas da base de dados. Assim haverá na tabela relacionada uma referência a essa chave primária (que será, na tabela relacionada, a chave estrangeira).

`CREATE TABLE tbl_Clientes
(
    ID_Cliente integer PRIMARY KEY,
    Nome_Cliente varchar(255),
    CPF_Cliente varchar(255),
    Data_Nasc varchar(255)
);`

### Chave estrangeira
A chave estrangeira, ou `foreign key`, é um conceito ligeiramente diferente. Ela não diz respeito, especificamente, a uma tabela, mas sim a um relacionamento entre tabelas

De forma sucinta, a chave estrangeira é uma referência em uma tabela a uma chave primária de outra tabela. Para facilitar a compreensão, tomemos como exemplo duas tabelas: `tbl_Clientes` e `tbl_Vendas`

Para montarmos um relacionamento entre elas poderíamos ter na tabela `tbl_Vendas` o campo `ID_Cliente` fazendo referência à chave primária da tabela `tbl_Clientes`.


Diferentemente da chave primária, a chave estrangeira:

- Pode ser nula (NOT NULL)
- É um campo em uma tabela que faz **referência a um campo que é chave primária em outra tabela**
- É possível ter mais de uma (ou nenhuma) em uma tabela

![](https://lh3.googleusercontent.com/proxy/wOirYDH_e0CyjwRNTu8kV7bGkS_QogMdbRxlgMOwuQMttFOWEPBNEfnIo5mk3tH5WyxzcilXd3CGaxGAE3kVytvt4KRxNKnAmMj7sxC1SbMD8C3JZ1wjxSpKEZGkD8vbPlWIRSGnECym7L6fdmIkU4aDjOkLRpL_tfVe2BCOx5ImLxkT)

![](https://miro.medium.com/max/1400/1*wr_PNTP9fQHxXeMydaSfnQ.jpeg)

## Conexao no db4free

- Para trabalhar com bancos de dados, temos que fazer uma conexão do nosso jupyter notebook com o banco de dados
- Antes disso, para evitar que nossos dados fiquem expostos no notebook e facilitar a manutenção de código, podemos criar um arquivo `yml` e adicionar nossas credenciais no formato:
    - `user: 'usuario'`
    - `password: 'senha'`
    - `host: 'db4free.net'`
    - `database: 'database'`
    - `port: 3306`

In [5]:
!pip install -U PyYAML

Requirement already satisfied: PyYAML in /usr/local/lib/python3.7/dist-packages (3.13)
Collecting PyYAML
  Downloading PyYAML-5.4.1-cp37-cp37m-manylinux1_x86_64.whl (636 kB)
     |████████████████████████████████| 636 kB 31.3 MB/s
Installing collected packages: PyYAML
  Attempting uninstall: PyYAML
    Found existing installation: PyYAML 3.13
    Uninstalling PyYAML-3.13:
      Successfully uninstalled PyYAML-3.13
Successfully installed PyYAML-5.4.1

In [1]:
import yaml

- `shift + tab` dentro do parenteses: abre a documentação

In [11]:
with open('credentials.yml', 'r') as file:
    credentials = yaml.load(file, Loader=yaml.FullLoader)

- Uma vez que importamos as credenciais, podemos fazer a conexão com o banco de dados

In [3]:
!pip uninstall mysql-connector

WARNING: Skipping mysql-connector as it is not installed.

In [4]:
!pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-8.0.26-cp37-cp37m-manylinux1_x86_64.whl (30.9 MB)
     |████████████████████████████████| 30.9 MB 79 kB/s
Requirement already satisfied: protobuf>=3.0.0 in /usr/local/lib/python3.7/dist-packages (from mysql-connector-python) (3.17.3)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.7/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (1.15.0)
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-8.0.26

In [5]:
# importando libs necessárias
import mysql.connector

In [6]:
from mysql.connector import __version__

In [7]:
__version__

'8.0.26'

In [12]:
con = mysql.connector.connect(user=credentials['user'],
                              password=credentials['password'],
                              host=credentials['host'],
                              database=credentials['database'],
                              port=credentials['port'])

cursor = con.cursor()

## Queries de criação e manipulação de tabelas

- Agora que estabelecemos a conexão com o banco de dados, podemos começar a aplicar as queries
- Podemos escrever as queries dentro da variável `query` e o `cursor.execute(query)` aplica a query

### Show tables

Mostrar tabelas do banco de dados

In [13]:
query = '''
    SHOW TABLES
'''

cursor.execute(query)

Buscar o resultado da query com o método `fetchall`

In [14]:
cursor.fetchall()

[]

### Create table

Criar tabela

In [20]:
query = ''' 
    CREATE TABLE empresas (estabelecimento CHAR(40),
                           receita INT,
                           custo INT,
                           anomes INT)    
''' 

cursor.execute(query)

In [16]:
query = '''
    SHOW TABLES
'''

cursor.execute(query)
cursor.fetchall()

[('empresas',)]

### Drop table

Deletar tabela

In [17]:
query = '''
    DROP TABLE empresas
'''

cursor.execute(query)

###  Insert into table

Agora que criamos uma tabela, podemos inserir valores nela

In [21]:

query = '''
    INSERT INTO empresas(estabelecimento, receita, custo, anomes)
    VALUES ('McDonalds', '5000', '4000', '201912')

'''

cursor.execute(query)

In [22]:
# f-string

numero = 10

print('o numero é', numero)
print(f'o numero é {numero}')

o numero é 10
o numero é 10

In [23]:
val = ("MCDonalds","5000","4000","201912")

query = f'''INSERT INTO empresas(estabelecimento,receita, custo, anomes) 
            VALUES ('{val[0]}','{val[1]}','{val[2]}','{val[3]}')'''


cursor.execute(query)

In [24]:
def input_data(con=con, cursor=cursor):
    print('Nome da empresa: ')
    estabelecimento = input()
    print('Receita da empresa: ')
    receita = input()
    print('Custo da empresa: ')
    custo = input()
    print('Ano e mês: ')
    anomes = input()
    
    query = f''' INSERT INTO empresas(estabelecimento, receita,
                                      custo, anomes)
                 VALUES ('{estabelecimento}', '{receita}',
                         '{custo}', '{anomes}')    
    '''''
    cursor.execute(query)
    print('Data inserted!')

In [26]:
input_data()

Nome da empresa:
Teste
Receita da empresa:
1000
Custo da empresa:
10
Ano e mês:
202107
Data inserted!

In [27]:
import pandas as pd

In [28]:
query = 'SELECT * FROM empresas'

pd.read_sql(query, con)

  estabelecimento  receita  custo  anomes
0       McDonalds     5000   4000  201912
1       MCDonalds     5000   4000  201912
2           Teste     1000     10  202107

###  Select

Podemos checar os valores com o comando `Select`

In [29]:
query = '''
    SELECT estabelecimento, receita, custo, anomes
    FROM empresas
'''

cursor.execute(query)
cursor.fetchall()

[('McDonalds', 5000, 4000, 201912),
 ('MCDonalds', 5000, 4000, 201912),
 ('Teste', 1000, 10, 202107)]

In [30]:
query = '''
    SELECT *
    FROM empresas
'''

cursor.execute(query)
cursor.fetchall()

[('McDonalds', 5000, 4000, 201912),
 ('MCDonalds', 5000, 4000, 201912),
 ('Teste', 1000, 10, 202107)]

- No caso de consulta, podemos usar a biblioteca de manipulação da dados `pandas`

In [31]:
import pandas as pd

In [32]:
pd.read_sql(query, con)

  estabelecimento  receita  custo  anomes
0       McDonalds     5000   4000  201912
1       MCDonalds     5000   4000  201912
2           Teste     1000     10  202107

In [33]:
# pandas permite rodar comandos sql do google big query
pd.read_gbq()

TypeError: ignored

###  Inserindo mais dados

In [34]:
val =  [("Wendys","6000","4500","202001"),
        ("Patties","900","900","202001"),
        ('Zebeleo', '5', '10000', '202002'),
        ('Koburger', '3000', '2500', '202002')]


sql = '''INSERT INTO empresas(estabelecimento, receita, custo, anomes) 
          VALUES (%s, %s, %s, %s)'''


cursor.executemany(sql, val)

In [35]:
query = '''
    SELECT * FROM empresas 
    
'''

pd.read_sql(query, con)

  estabelecimento  receita  custo  anomes
0       McDonalds     5000   4000  201912
1       MCDonalds     5000   4000  201912
2           Teste     1000     10  202107
3          Wendys     6000   4500  202001
4         Patties      900    900  202001
5         Zebeleo        5  10000  202002
6        Koburger     3000   2500  202002

### Delete

Podemos deletar uma linha do banco de dados

In [ ]:
query = '''
    DELETE 
    FROM empresas
    WHERE estabelecimento = 'Bullguer'    
'''

cursor.execute(query)

In [ ]:
query = '''
    SELECT * FROM empresas 
    
'''

pd.read_sql(query, con)

  estabelecimento  receita  custo  anomes
0       McDonalds     5000   4000  201912
1       McDonalds     5000   4000  201912
2          Wendys     6000   4500  202001
3         Patties      900    900  202001
4         Zebeleo        5  10000  202002
5        Koburger     3000   2500  202002

### Update

Podemos atualizar um valor da tabela

In [ ]:
query = '''
    UPDATE empresas
    SET estabelecimento = 'Hamburgueria'
    WHERE estabelecimento = 'Patties'
'''
cursor.execute(query)

In [ ]:
query = '''
    SELECT * FROM empresas     
'''

pd.read_sql(query, con)

  estabelecimento  receita  custo  anomes
0       McDonalds     5000   4000  201912
1       McDonalds     5000   4000  201912
2          Wendys     6000   4500  202001
3    Hamburgueria      900    900  202001
4         Zebeleo        5  10000  202002
5        Koburger     3000   2500  202002